In [4]:
%matplotlib inline
import pandas as pd

In [3]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

FileNotFoundError: [Errno 2] No such file or directory: 'style-table.css'

In [5]:
titles = pd.read_csv('H:/Shubham Coding/Classwork/Day 14 to - Exploratory Data Science/Day 16 - 17/Dataset for Pandas Assinment/titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [19]:
rel_dates = pd.read_csv('H:/Shubham Coding/Classwork/Day 14 to - Exploratory Data Science/Day 16 - 17/Dataset for Pandas Assinment/release_dates.csv')
rel_dates.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

In [21]:
cast = pd.read_csv('H:/Shubham Coding/Classwork/Day 14 to - Exploratory Data Science/Day 16 - 17/Dataset for Pandas Assinment/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

###  1. How many movies are listed in the titles dataframe?

In [22]:
print("No. of movies that are listed in the titles Dataframe : ",len(titles))

No. of movies that are listed in the titles Dataframe :  244914

### 2. What are the earliest two films listed in the titles dataframe?

In [23]:
titles.sort_values('year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### 3. How many movies have the title "Hamlet"?

In [24]:
print("No. of movies with title name 'Hamlet' are : ",len(titles[titles.title=='Hamlet']))

No. of movies with title name 'Hamlet' are :  20

### 4. How many movies are titled "North by Northwest"?

In [25]:
print("No. of movies with title name 'North by Northwest' are : ",len(titles[titles.title=='North by Northwest']))

No. of movies with title name 'North by Northwest' are :  1

### 5. When was the first movie titled "Hamlet" made?

In [26]:
print("The First movie with title 'Hamlet' was made :\n")
titles[titles.title=='Hamlet'].sort_values('year').head(1)

The First movie with title 'Hamlet' was made :

        title  year
52521  Hamlet  1910

### 6. List all of the "Treasure Island" movies from earliest to most recent.

In [27]:
print("The list of all movies named 'Treasure Island' from earliest to most recent are :\n")
titles[titles.title=='Treasure Island'].sort_values('year')

The list of all movies named 'Treasure Island' from earliest to most recent are :

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### 7. How many movies were made in the year 1950?

In [32]:
print("The list of movies that were made in the year 1950 : ")
titles[titles.year==1950].year.count()

The list of movies that were made in the year 1950 :

1113

### 8. How many movies were made in the year 1960?

In [34]:
print("The list of movies that were made in the year 1960 : ")
titles[titles.year==1960].year.count()

The list of movies that were made in the year 1960 :

1549

### 9. How many movies were made from 1950 through 1959?

In [35]:
titles[(titles.year>=1950)&(titles.year<=1959)].year.count()

12934

### 10. In what years has a movie titled "Batman" been released?

In [36]:
titles[titles.title=='Batman']

         title  year
39349   Batman  1943
240896  Batman  1989

### 11. How many roles were there in the movie "Inception"?

### 12. How many roles in the movie "Inception" are NOT ranked by an "n" value?

### 13. But how many roles in the movie "Inception" did receive an "n" value?

### 14. Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

### 15. Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

### 16. Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

### 17. How many roles were credited in the silent 1921 version of Hamlet?

### 18. How many roles were credited in Branagh’s 1996 Hamlet?

### 19. How many "Hamlet" roles have been listed in all film credits through history?

### 20. How many people have played an "Ophelia"?

### 21. How many people have played a role called "The Dude"?

### 22. How many people have played a role called "The Stranger"?

### 23. How many roles has Sidney Poitier played throughout his career?

### 24. How many roles has Judi Dench played?

### 25. List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

### 26. List the leading roles that Cary Grant played in the 1940s in order by year.

### 27. How many roles were available for actors in the 1950s?

### 28. How many roles were available for actresses in the 1950s?

### 29. How many leading roles (n=1) were available from the beginning of film history through 1980?

### 30. How many non-leading roles were available through from the beginning of film history through 1980?

### 31. How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?